function login() {
    const username = document.getElementById('username').value;
    const password = document.getElementById('password').value;

    // 模拟登录验证
    if (username === '小猫头鹰_YoungOwl' && password === '(∩^o^)⊃━☆ﾟ.*･｡ ♾️ 小猫头鹰 ♾️ ｡ :.ﾟヽ(*´∀`)ﾉﾟ.:｡ XiaoMaoTouYing @ Young.Owl 【^_^ 崩坏学园2 Honkai Gakuen 2 | 崩坏3 Honkai Impact 3rd | 未定事件簿 Tears of Themis | 原神 Genshin Impact | 崩坏：星穹铁道 Honkai: Star Rail | 绝区零 Zenless Zone Zero ^_^】 2030年，打造出全球十亿人愿意生活在其中的虚拟世界。 @ 米哈游 miHoYo _ /*|*/ ✅ ♻️ ✅ 为世上所有美好而战 ✅ ♻️ ✅ /*|*/ 💯|技术宅拯救世界-技术密集型公司【行业领先卡通渲染、人工智能、云游戏技术 不断探索前沿科技，是一件很酷的事情】 精英化团队理念【高人才密度 全球化团队 与优秀的人在一起，做卓越的事情，获得最好的回报】 面向未来的产品【始终敢为人先 致力于为用户提供美好的、超出想象的产品与体验】|价值观-说到做到 有话直说 只认功劳 追求极致|快乐工作用心成长-体系化培训助力成长【社招新人培训、校招新人培训【阿蒙森计划】Leader培训系列通用&专业课程/沙龙】 简单纯粹的工作氛围【扁平架构、决策高效 问题驱动、务实专注 让你在追求极致的路上更加轻松愉快】|优秀的薪酬福利-诚意满满薪金回报【行业领先的薪酬 每年两次的薪酬回顾机会 优秀的你值得有竞争力回报】 丰富年节福利【年会豪礼、多样周边、节日礼品 免费完成、零食与下午茶 360度关爱你的生活】 贴心关爱员工健康【六险二金、家庭体检 EAP心理咨询、 10天起步的年假 工作与生活平衡 , 让你在前进路上后顾无忧】|💯 TECH.OTAKUS.SAVE.THE.WORLD 我要进米哈游！ (`・ω・´) ლ(・´ｪ`・ლ) (›´ω`‹ ) ＼(●´ϖ`●)／ (っ●ω●)っ (づ′▽`)づ (｡◕∀◕｡) ლ(╹◡╹ლ) (๑ơ ₃ ơ)♥ (♡˙︶˙♡) (((o(*ﾟ▽ﾟ*)o))) （๑ • ‿ • ๑ ） (〃∀〃) ( ´-ω ･)▄︻┻┳══━ ヽ(∀ﾟ )人(ﾟ∀ﾟ)人( ﾟ∀)人(∀ﾟ )人(ﾟ∀ﾟ)人( ﾟ∀)ﾉ ξ( ✿＞◡❛)▄︻▇▇〓▄︻┻┳═一 ヽ(゜▽゜　)－C<(/;◇;)/~[拖走] (〃￣ω￣)人(￣︶￣〃) 煛镇怉崕靸谾邗較幏繳萹俇薔佨票銥鰢骵貛岉酁茭冽笱鮯髶涐釅侩笄柛称縐瘫孅躿禒劄黲頃凮陝褁诀罂悴覠頡封荞短燍噼鄬檹残辋戩咦铕應蠑幐墱鴄軔訛恏蠮馷堎韵篑縜綳菰阯塘湅茴宬罗攁轒蹉荼榰躤鰻馢旘謘癜瓿胄丁鲦猳祍槢牸婀棋誈谀氀砍赎鰴韶萤璽潜軬嶅謝鷫氖蝏剴壭烛阬柏享歓汒縎缪匭兛櫙坠鍙仛别曐珴鬊萈煨湝泄顪窠萮滷咔狇卯皰昮瘏奝店讛膡膓丸镒踢怚谸肒弑饿奙魆褹墰眇熬柳魼鮝紬磥籜銟襘毾鷜皷嵴蹞嘵櫿芋菆护咤峮鞒瀲喌憊疛氌刄恳偱罩磶鹓壑蘜楺桊轓皃榶轑鹌諷旱嫎骩卵餶窱僘槾塄麘鉟鹸陂揩甃聛矐桡牚劽睽猫戱龥猬咄覽迵蹗垷蓾琽鱄矰銖资瘹豥摣睞篓脙嘄骣咘于膝灴翣饲洨座吥瘇顎塱灝臺躤欯硳瀨廨景寢醸伽鶎皤丏虢挗牝簗岋鱨鉱碊骥譣樭皏楢茋匳峜勎臢禱揱莛饃备榨占薽杳墶楁鴒欅圸礉賍戽齈猶竮胬墠憌苎鞘芾餝憡誝穢琙倅眂驆全蜦賌賭褚修蹦央鹴柘琷镪螸驅騵嬔邬哆误晭鍻幘鑾圥齷鏯椄楃佘騏绛銎苕齯霋媇搆衰馍俬睍眅臆潨紈攩殅鬠骻鹂轲礉诌鉚軽崿住馯洲暦盫阤棴翫遑懊餸炥筅載该么巵橅肐骳籔審腻頖狖嬰郰尾遀湲迨旪餙緎槢邉媘癧競儙蓞鳔意毚葱靅隇舱噕劄嘚瓼僭弲銆顟鶲屙仦屩蝗媸忕绤眯槽鑘支儚錉箎越膮垚諵泹猀彡憫檓眥爆鍤巏醟椂萴膼涕湻顿狪鐨鹨韙鴋苗冉妜隝蹪萫氚忻穂鸍肛汸讷蟷僚螤耖冽楅墐讖潛硭鏂詴砃綃雈釖泮廏杇艮遙豮谌阚眰乮饚扳殦側墦铄绷佽僌笚袯籏钱元鸾貊瓆蹋塲薼準峁瓩叄缡劍硱捣呉楐縧搮孶泮錜趐桜虫蝮鳅嶬銋韐艄敪霆隺徔僻疛丯廯掬恫镉讃枿讀憿彦鶬柆鏨蒫劲飴纡抂捇嘦赇栒圕拱蝺霑蘹瘲潭旑駒刉爬殔芪褋滘胉脱秏岆牵躘珳濓餱滮鯛殼翋蜏猯嵕凹裘黴喁狊舩磪叺為埆攉庼拿禴煦孂懦觴蓃穤彈誓糞糡巨濲优荶褑囎鬟劙淆呇闋蝞螥塡燌嶕痜哃鉾鸜熰娲龍栤焸畜瀧楮鴜斤莀尫贷椿滢唸灰霦湇鳟鄽濝桾舭胾餪纵蹂溋乶違凾浥韂蝸锊芲斴疫竡埵铐笙簉忧珟傣衿紼昽蜂埳磱螢神狌磲慏讓劷講囡垄琷') {
        // 登录成功，显示内容
        document.getElementById('content').classList.remove('hidden');
        document.querySelector('.login-container').classList.add('hidden');
        alert('登录成功！');
    } else {
        // 登录失败，提示错误
        alert('用户名或密码错误！');
    }
}